[
    {
    "category" : "Experience",
    "area": "National Cancer Institute, Fort Detrick, MD",
    "date": "Mary 2018 - August 2019",
    "role": "Werner H. Kirsten Intern",
    "description": ["Applied several computational approaches to perform RNA structural analysis.",
                    "Preformed molecular mechanics and molecular dynamic simulations of RNA using high-performance structural facilities.",
                    "Enhance and help develop new algorithms for our computational RNA-based software. This includes adding features for the prediction and characterization of our RNA nano-biology structures for potential therapeutic use.",
                    "Searches for interesting functional features in RNA sequences and their structures."]
    }, 

    {
        "category" : "Experience" ,
        "date": "May 2022-August 2022", 
        "area": "Applied Research Laboratory for Intelligence and Security, College Park, MD" ,
        "role": "Research for Intelligence and Security Summer Intern",
        "description" : ["Collaborated with the US Department of Air Force to identify bias within their AI systems.",
                        "Research and address current thinking related to AI ethics and algorithmic building and training.",
                        "Curate a set of priorities and business practices for guiding the integration of AI ethics into the workflow."]
    },

    {
        "category" : "Activities" ,
        "date": "August 2019- December 2020",
        "area": "University of Maryland, College Park",
        "role": "FIRE Participant at UMD",
        "description": ["FIRE is a first-year student program that focuses on providing research experience to new students. Our group focused on transcriptomics of diseases and genome sequencing."]
    }

    {
        "category" : "Activities" ,
        "date": "January 2022 - May 2022",
        "area": "University of Maryland, College Park",
        "role": "Acedemic Peer Mentor",
        "description": ["Provided students with help with assignments and concepts during office hours and aid during class discussions.",
                        "Provided weekly private sessions to special needs students for further clarification on class subjects and assignments."]
    }

    {
        "category" : "Activities" ,
        "date": "August 2022 - January 2023",
        "area": "University of Maryland, College Park",
        "role": "Undergraduate Teacher Assistant",
        "description": ["Provided help to students during office hours and class time with course concepts and assignments regarding object-oriented programming.",
                        "Assisted professor with grading and other preparations regarding course activies."]
    }

    {
        "category" : "Activities" ,
        "date" : "October 2022 - Present", 
        "area": "University of Maryland, College Park" ,
        "role": "NET+ Fellowship",
        "description": ["Worked closely with instructors to co-design ethics actives for courses in the Information Science department."]
    }

    {
        "category": "Coursework", 
        "classes": {"Object-Oriented Programming": "A+" ,
                    "Database Design and Modeling": "A+", 
                    "Technologies, Infrastructure and Architecture": "A+",
                    "User-Centered Design": "A", 
                    "Dynamic Web Applications": "A",
                    "Human-Centered Cybersecurity": "A-",
                    "Introduction to Data Visualization": "A+", 
                    "Data Sources and Manipulation": "A-"

        }
    }


]